{
  "ReleaseNotes": [
    {
      "date": "13-05-2025",
      "version": "v0.7.3",
      "Items": [
        {
          "description": "Adjusted the text for the spell Life Draw (Death B) and duration for the technique Confusing Blow (Strength)",
          "title": " Bugfix: Minimal textual adjustments"
        }
      ]
    },
    {
      "date": "23-07-2024",
      "version": "v0.7.2",
      "Items": [
        {
          "description": "When switching language, the page may sometimes not translate all values correctly, due to a local browser cache. This change enforces refreshing and reloading of resources.",
          "title": " Bugfix: Partial translation due to caching "
        }
      ]
    },
    {
      "date": "20-07-2024",
      "version": "v0.7.1",
      "Items": [
        {
          "description": "The entire page and source files dynamically change language. All source files have been translated.",
          "title": "Feature: Added English Translation"
        }
      ]
    },
    {
      "date": "05-07-2024",
      "version": "v0.6.1",
      "Items": [
        {
          "description": "With the latest update, some names and references have been changed. Skills, spells, recipes, and associated texts/page numbers have been reviewed and adjusted where necessary.",
          "title": "Rules: Content and URL references updated to the rulebooklets."
        },
        {
          "description": "The method of fetching data from source files has been made more defensive and simultaneously adjusted to support multiple languages in the future.",
          "title": "Technology: Various background adjustments in source file references."
        },
        {
          "description": "Exporting a character to a file could result in a file without a version number. This could result in an unusable file.",
          "title": "BugFix: Export of character to file"
        },
        {
          "description": "Previously, the requirements for skills were not always displayed correctly. These have been improved and supplemented with category requirements.",
          "title": "Looks & Feels: Requirements display for skills improved in PDF export."
        },
        {
          "description": "The use of 'Pound of Elemental Flesh' material has been added to all crafting skills.",
          "title": "Maintenance: Pound of Elemental Flesh added as component to Recipes"
        }
      ]
    },
    {
      "date": "30-04-2024",
      "version": "v0.5.6",
      "Items": [
        {
          "description": "The description of several templates has been adjusted for clarification.",
          "title": "Looks & Feels: Various textual adjustments in template descriptions."
        },
        {
          "description": "The description of a template was divided into two fields, causing the text to display incorrectly. This has been changed to one field.",
          "title": "Looks & Feels: Template description field size."
        }
      ]
    },
    {
      "date": "20-04-2024",
      "version": "v0.5.5",
      "Items": [
        {
          "description": "When the 'new character' checkbox is checked, it is no longer possible to select 'Mentor Expertise' from the selection list.",
          "title": "Looks & Feels: Mentor Expertise no longer available for new characters."
        },
        {
          "description": "Character properties have been split between Character Properties and Energy per Day for clarification.",
          "title": "Looks & Feels: Splitting properties and Energy per Day."
        },
        {
          "description": "To improve field changes on mobile devices, the minimum value for the Max XP field has been adjusted from 1 > 0.",
          "title": "BugFix: Minimum MaxXP value lowered to 0."
        },
        {
          "description": "Panels can now be closed by clicking outside the window, in addition to the close button (X).",
          "title": "Looks & Feels: Updated panel closing."
        },
        {
          "description": "Descriptions of several imbue-enhancing value components have been adjusted for clarification.",
          "title": "Looks & Feels: Clarification of certain crafting components."
        },
        {
          "description": "Switching between new/existing and back to new could result in negative total XP. Adding a skill would result in an error message.",
          "title": "BugFix: Adding skill with negative total XP."
        },
        {
          "description": "When a new item is added to the table, the chosen sorting remains intact.",
          "title": "BugFix: Sorting in table preserved."
        },
        {
          "description": "There was a missing import for a font, which could result in an error when exporting a PDF document.",
          "title": "BugFix: Console Error missing font type."
        }
      ]
    },
    {
      "date": "16-04-2024",
      "version": "v0.5.4",
      "Items": [
        {
          "description": "Correction on inspiration gained from the skill Knowledge of Herbs. 3 > 2 inspiration.",
          "title": "BugFix: Knowledge of Herbs Correction."
        },
        {
          "description": "Correction on maximum XP that can be stored when creating a new character. 2 > 3 XP.",
          "title": "BugFix: Correction on maximum XP to be stored for new character."
        },
        {
          "description": "Correction on panel size causing items to not display correctly in some cases.",
          "title": "Looks & Feels: Correction panel size Spells, Techniques & Recipes."
        },
        {
          "description": "Correction on tooltip when displaying a spell, technique, or recipe. The term mana has been replaced by the overarching, correct term: energy.",
          "title": "BugFix: Correction on tooltip for Spells, Techniques & Recipes."
        }
      ]
    },
    {
      "date": "06-11-2023",
      "version": "v0.5.3",
      "Items": [
        {
          "description": "Each template has received a description of the archetype character and any advice for playing this type at VA.",
          "title": "Feature: Templates include additional description."
        },
        {
          "description": "In addition to the restriction that a maximum of 2 XP can be stored for a new character, new players can now make changes via the info desk during or after the first event.",
          "title": "Looks/Feels: Addition to minimum XP"
        },
        {
          "description": "Export to PDF includes an image of character properties. This image was sometimes distorted due to different dimensions.",
          "title": "Bugfix: Export to PDF may contain distorted images."
        },
        {
          "description": "To better maintain source files, multiple validations have been added to ensure consistent maintenance.",
          "title": "Maintenance: Addition of validations on source files"
        }
      ]
    },
    {
      "date": "30-10-2023",
      "version": "v0.5.2",
      "Items": [
        {
          "description": "Clicking on the version displays the release information. Release information is automatically shown upon an update when the 'automatically show release information' checkbox is checked.",
          "title": "Feature: Release information visible to users"
        },
        {
          "description": "When the checkbox is unchecked, the input remains. Only when enabled, everything is cleared when one or more extra skills are present.",
          "title": "Looks/Feels: Checkbox 'New character' toggle doesn't always clear the grid."
        },
        {
          "description": "When the new character checkbox is checked, no more than 2 XP may remain. This is indicated by red text and an info button.",
          "title": "Looks/Feels: Starting character may not keep more than 2 XP"
        },
        {
          "description": "Export to PDF includes an image of character properties. This image was improperly scaled when exported from a mobile device.",
          "title": "Bugfix: Export to PDF image does not scale correctly when exported from a mobile device"
        },
        {
          "description": "When selecting the Paladin preset, it was not loaded due to a layout error.",
          "title": "Bugfix: Paladin preset did not load."
        },
        {
          "description": "When loading a character, the Basic and Extra selection fields were not cleared. This allowed skills to be entered twice, leading to errors.",
          "title": "Bugfix: Loading a character potentially led to duplicate skills"
        },
        {
          "description": "To improve maintainability and enhance component quality, certain notification functionalities have been decentralized.",
          "title": "Maintenance: General improvements and maintenance."
        }
      ]
    },
    {
      "date": "28-10-2023",
      "version": "v0.5.1",
      "Items": [
        {
          "description": "When saving/exporting a character, all data from skills was exported, causing updated skills to not be visible and old issues to persist. Method of saving/exporting has been adjusted; existing saves/exports are converted upon loading.",
          "title": "Feature: Adjustment to save/export of a character."
        },
        {
          "description": "When a character name is entered, it is saved. Both in exports and temporary browser storage, it is remembered.",
          "title": "Feature: Entered character name is remembered."
        }
      ]
    },
    {
      "date": "26-10-2023",
      "version": "v0.5.0",
      "Items": [
        {
          "description": "When a character is prepared (created or loaded), it can be downloaded as a PDF export.",
          "title": "Feature: Exporting character to a PDF file"
        },
        {
          "description": "A regression test revealed a specific situation where it was possible to exceed the max XP limit when adding skills.",
          "title": "Bugfix: Exceeded max XP in specific situation."
        }
      ]
    }
  ]
}